import math
di = float(input('Введите доверительный интервал ')) #доверительный интервал
ki = float(input('Введите количество измерений ')) #количество измерений
t_p_sis = 0.005
r_p=0.005
h_p=0.005
kfst = {
    0.95: {1: 12.706, 2: 4.303, 3: 3.182, 4: 2.781, 5: 2.571, 6: 2.447, 7: 2.365, 8: 2.306, 9: 2.262, 10: 2.228, 11: 2.201,
        12: 2.179, 13: 2.160, 14: 2.145, 15: 2.130, 16: 2.115, 17: 2.107, 18: 2.103, 19: 2.093, 20: 2.086, 21: 2.080,
        22: 2.074, 23: 2.069, 24: 2.064, 25: 2.060, 26: 2.056, 27: 2.052, 28: 2.048, 29: 2.045, 30: 2.042},
    0.99: {1: 63.657, 2: 9.925, 3: 5.841, 4: 4.602, 5: 4.032, 6: 3.707, 7: 3.499, 8: 3.355, 9: 3.250, 10: 3.169, 11: 3.106,
        12: 3.055, 13: 3.012, 14: 2.977, 15: 2.956, 16: 2.928, 17: 2.901, 18: 2.878, 19: 2.861, 20: 2.845, 21: 2.831,
        22: 2.819, 23: 2.807, 24: 2.797, 25: 2.787, 26: 2.779, 27: 2.771, 28: 2.769, 29: 2.756, 30: 2.750},
    0.999: {1: 636.619, 2: 31.598, 3: 12.941, 4: 8.610, 5: 6.859, 6: 5.959, 7: 5.405, 8: 5.041, 9: 4.781, 10: 4.578, 11: 4.487,
        12: 4.318, 13: 4.221, 14: 4.140, 15: 4.048, 16: 3.996, 17: 3.951, 18: 3.922, 19: 3.883, 20: 3.850, 21: 3.819,
        22: 3.792, 23: 3.767, 24: 3.745, 25: 3.725, 26: 3.707, 27: 3.690, 28: 3.674, 29: 3.659, 30: 3.646}
}
#Заполняем словарь t значениями измерений
t={1: {}, 2: {}, 3: {}}
for i in range(3):
    print('введите значения t_', i+1, sep='')
    for k in range(int(ki)):
        t[i+1][k+1]=float(input())
#print(t)
#Заполняем словарь t_sr средними значениями словаря t[i]
t_sr={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    for k in range(int(ki)):
        t_sr[i+1]=float(t_sr[i+1])+float(t[i+1][k+1])
    t_sr[i+1]=t_sr[i+1]/ki
#print(t_sr)
#
S={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    for k in range(int(ki)):
        S[i+1]=S[i+1]+(t_sr[i+1]-t[i+1][k+1])**2
    S[i+1]=(S[i+1]/(ki-1))**0.5
#print(S)
#
t_p_sl={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    t_p_sl[i+1]=kfst[di][ki]*S[i+1]
#print(t_p_sl)
#
t_p_ab={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    t_p_ab[i+1]=((t_p_sl[i+1]**2)+(t_p_sis**2))**0.5
#print(t_p_ab)
#
b_t={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    b_t[i+1]=t_p_ab[i+1]/t_sr[i+1]
#print(b_t)
#
h=float(input('Введите значение h'))
r=float(input('Введите значение радиуса шкива'))
#
ba={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    ba[i+1]=(h*2)/((t_sr[i+1]**2)*r)
#print(ba)
#
b_ba={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    b_ba[i+1]=(((h_p/h)**2)+((2*t_p_ab[i+1]/t_sr[i+1])**2)+((r_p/r)**2))**0.5
#print(b_ba)
#
ba_p={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    ba_p[i+1]=b_ba[i+1]*ba[i+1]
#print(ba_p)
#
m=0.0583
g=9.8
#
N={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    N[i+1]=m*(g-((h*2)/(t_sr[i+1]**2)))
#print(N)
#
b_N={1: 0.0, 2: 0.0, 3: 0.0}
for i in range(3):
    b_N[i+1]=((r_p/r)**2)+(((h_p*2)/((t_sr[i+1]**2)*(g-((h*2)/(t_sr[i+1]**2)))))**2)+(((h*4*t_p_ab[i+1])/((t_sr[i+1]**3)*(g-((h*2)/(t_sr[i+1]**2)))))**2)
print(b_N)
#