import math
di=0
ki=0
di = input('Введите доверительный интервал ') #доверительный интервал
ki = input('Введите количество измерений ') #количество измерений
di = float(di)
ki = float(ki)
kfst = {
    0.95: {1: 12.706, 2: 4.303, 3: 3.182, 4: 2.781, 5: 2.571, 6: 2.447, 7: 2.365, 8: 2.306, 9: 2.262, 10: 2.228, 11: 2.201,
        12: 2.179, 13: 2.160, 14: 2.145, 15: 2.130, 16: 2.115, 17: 2.107, 18: 2.103, 19: 2.093, 20: 2.086, 21: 2.080,
        22: 2.074, 23: 2.069, 24: 2.064, 25: 2.060, 26: 2.056, 27: 2.052, 28: 2.048, 29: 2.045, 30: 2.042},
    0.99: {1: 63.657, 2: 9.925, 3: 5.841, 4: 4.602, 5: 4.032, 6: 3.707, 7: 3.499, 8: 3.355, 9: 3.250, 10: 3.169, 11: 3.106,
        12: 3.055, 13: 3.012, 14: 2.977, 15: 2.956, 16: 2.928, 17: 2.901, 18: 2.878, 19: 2.861, 20: 2.845, 21: 2.831,
        22: 2.819, 23: 2.807, 24: 2.797, 25: 2.787, 26: 2.779, 27: 2.771, 28: 2.769, 29: 2.756, 30: 2.750},
    0.999: {1: 636.619, 2: 31.598, 3: 12.941, 4: 8.610, 5: 6.859, 6: 5.959, 7: 5.405, 8: 5.041, 9: 4.781, 10: 4.578, 11: 4.487,
        12: 4.318, 13: 4.221, 14: 4.140, 15: 4.048, 16: 3.996, 17: 3.951, 18: 3.922, 19: 3.883, 20: 3.850, 21: 3.819,
        22: 3.792, 23: 3.767, 24: 3.745, 25: 3.725, 26: 3.707, 27: 3.690, 28: 3.674, 29: 3.659, 30: 3.646}
}
print('Коэффициент Стьюдента = ', kfst[di][ki])
t = [] #Создаём строку со значениями измерений
k=0.0 #Орорная переменная для записи значений
ki=int(ki)
print('Введите результаты измерений')
while len(t)!=ki:
    k=input()
    t.append(k)
ts=0.0
for i in range(len(t)):
    ts=ts+float(t[i])
ts=ts/len(t) #Вычисление среднего значения измерений
print('Среднее значение t = ', ts)
s=0.0
k=0.0
ts2=0.0
for i in range(len(t)):
    s=ts-float(t[i])
    s=s**2
    k=k+s
ts2=(k/(len(t)-1))**0.5 #Среднее квадратичное
print('Среднее квадратичное значение погрешности единичных измерений t = ', ts2)
ts2=ts2/(ki**0.5) #Просто среднее)))
print('Среднее значение погрешности t = ', ts2)
s=input('Введите значение системной погрешности')
ts3=0.0
ts3=(float(s)**2+(float(kfst[di][ki])*ts2)**2)**0.5 #Абсолютная погрешность
print('Абсолютная погрешнсть t = ', ts3)
ot=ts3/ts
print('Относительная погрешность t = ', ot)
print('t = ', ts, ' +- ', ot)
h=input('Укажите ход платформы h ')
h=float(h)
a=0.0
a=2*h+ts**2
ap=(2*ot/ts)**0.5
print('Ускорение a = ', a, ' +- ', ap)
r1=23.0
r1p=2.0
r2=44.0
r2p=2.0
print('Шкиф r1 = ', r1, ' +- ', r1p)
print('Шкиф r2 = ', r2, ' +- ', r2p)
b2=0.0
bp2=0.0
b1=0.0
bp1=0.0
b1=a/r1
bp1=(ap**2+r1p**2)**0.5
print('Для шкифа r1, b = ', b1, ' +- ', bp1)
b2=a/r2
bp2=(ap**2+r2p**2)**0.5
print('Для шкифа r2, b = ', b2, ' +- ', bp2)
m=input('Введите массу платформы с грузом ')
m=float(m)
n1=0.0
n2=0.0
n1=m*(9.8-a)*r1
np1=(ap**2+r1p**2)**0.5
print('Для шкифа r1, момент силы натяжения нити N = ', n1, ' +- ', np1)
n2=m*(9.8-a)*r2
np2=(ap**2+r2p**2)**0.5
print('Для шкифа r2, момент силы натяжения нити N = ', n2, ' +- ', np2)
I1=m*(r1**2)*(9.8*(ts**2)/2*h-1)
Ip1=(r1p**2+ot**2)**0.5
print('Момент инерции маятника (для r1) I = ', I1, ' +- ', Ip1)
I2=m*(r2**2)*(9.8*(ts**2)/2*h-1)
Ip2=(r2p**2+ot**2)**0.5
print('Момент инерции маятника (для r2) I = ', I2, ' +- ', Ip2)
ntr1=n1-I1*b1
ntr1p=(np1**2+Ip1**2+bp1**2)**0.5
ntr2=n2-I2*b2
ntr2p=(np2**2+Ip2**2+bp2**2)**0.5
print('Сила трения (для r1) Nтр =', ntr1, ' +- ', ntr1p)
print('Сила трения (для r2) Nтр =', ntr2, ' +- ', ntr2p)